gmtcontrol/nuttx/arch/arm/src/ra6m5/ra6m5_rtc.c
static inline void ra6m5_rtc_putreg16(uint32_t offset, uint16_t value)
{
  putreg16(value, RA6M5_RTC_BASE + offset);
}

/****************************************************************************
 * Name: rtc_dumpregs
 *
 * Description:
 *    Disable RTC write protection
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

#ifdef CONFIG_DEBUG_RTC_INFO
static void rtc_dumpregs(const char *msg)
{
  rtcinfo("%s:\n", msg);
  rtcinfo("  64-Hz Counter: %08x\n", ra6m5_rtc_getreg(RA6M5_RTC_R64CNT));
  rtcinfo("  Second Counter: %08x\n", ra6m5_rtc_getreg(RA6M5_RTC_RSECCNT_OFFSET));
  rtcinfo("  Minute Counter: %08x\n", ra6m5_rtc_getreg(RA6M5_RTC_RMINCNT_OFFSET));
  rtcinfo("  Hour Counter: %08x\n", ra6m5_rtc_getreg(RA6M5_RTC_RHRCNT_OFFSET));
  rtcinfo("  Day-of-Week Counter: %08x\n", ra6m5_rtc_getreg(RA6M5_RTC_RWKCNT_OFFSET));
  rtcinfo("  Date Counter: %08x\n", ra6m5_rtc_getreg(RA6M5_RTC_RDAYCNT_OFFSET));
  rtcinfo("  Month Counter: %08x\n", ra6m5_rtc_getreg(RA6M5_RTC_RMONCNT_OFFSET));
  rtcinfo("  Year Counter: %08x\n", ra6m5_rtc_getreg(RA6M5_RTC_RYRCNT_OFFSET));
  rtcinfo(" Second Alarm Register: %08x\n", ra6m5_rtc_getreg(RA6M5_RTC_RSECAR_OFFSET));
  rtcinfo(" Minute Alarm Register: %08x\n", ra6m5_rtc_getreg(RA6M5_RTC_RMINAR_OFFSET));
  rtcinfo(" Hour Alarm Register: %08x\n", ra6m5_rtc_getreg(RA6M5_RTC_RHRAR_OFFSET));
  rtcinfo(" Day-of-Week Alarm Register: %08x\n", ra6m5_rtc_getreg(RA6M5_RTC_RWKAR_OFFSET));
  rtcinfo(" Date Alarm Register: %08x\n", ra6m5_rtc_getreg(RA6M5_RTC_RDAYAR_OFFSET));
  rtcinfo(" Month Alarm Register: %08x\n", ra6m5_rtc_getreg(RA6M5_RTC_RMONAR_OFFSET));
  rtcinfo(" Year Alarm Register: %08x\n", ra6m5_rtc_getreg(RA6M5_RTC_RYRAR_OFFSET));
  rtcinfo(" Year Alarm Enable Register: %08x\n", ra6m5_rtc_getreg(RA6M5_RTC_RYRAREN_OFFSET));
  rtcinfo(" RTC Control Register 1: %08x\n", ra6m5_rtc_getreg(RA6M5_RTC_RCR1_OFFSET));
  rtcinfo(" RTC Control Register 2: %08x\n", ra6m5_rtc_getreg(RA6M5_RTC_RCR2_OFFSET));
  rtcinfo(" RTC Control Register 4: %08x\n", ra6m5_rtc_getreg(RA6M5_RTC_RCR4_OFFSET));
}
#else
#  define rtc_dumpregs(msg)
#endif

/****************************************************************************
 * Name: rtc_dumptime
 *
 * Description:
 *    Disable RTC write protection
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

#ifdef CONFIG_DEBUG_RTC_INFO
static void rtc_dumptime(struct tm *tp, const char *msg)
{
  rtcinfo("%s:\n", msg);
  rtcinfo("  tm_sec: %08x\n", tp->tm_sec);
  rtcinfo("  tm_min: %08x\n", tp->tm_min);
  rtcinfo(" tm_hour: %08x\n", tp->tm_hour);
  rtcinfo(" tm_mday: %08x\n", tp->tm_mday);
  rtcinfo("  tm_mon: %08x\n", tp->tm_mon);
  rtcinfo(" tm_year: %08x\n", tp->tm_year);
}
#else
#  define rtc_dumptime(tp, msg)
#endif

/****************************************************************************
 * Name: rtc_dec2bcd
 *
 * Description:
 *   Converts decimal value to BCD format
 *
 * Input Parameters:
 *   value - The byte to be converted.
 *
 * Returned Value:
 *   The value in BCD representation
 *
 ****************************************************************************/

static uint32_t rtc_dec2bcd(uint8_t value)
{
  return (uint8_t) ((((value / 10) << 4) & 0xf0) | (value % 10));
}

/****************************************************************************
 * Name: rtc_bcd2dec
 *
 * Description:
 *   Convert from 2 digit BCD to decimal.
 *
 * Input Parameters:
 *   value - The BCD value to be converted.
 *
 * Returned Value:
 *   The value in binary representation
 *
 ****************************************************************************/

#if defined (CONFIG_RTC_HIRES) || defined (CONFIG_RTC_ALARM) || defined (CONFIG_RTC_DATETIME)
static int rtc_bcd2dec(uint32_t value)
{
  return (int) ((((value & 0xf0) >> 4) * 10) + (value & 0x0f));
}
#endif

/****************************************************************************
 * Name: rtc_interrupt
 *
 * Description:
 *    RTC interrupt service routine
 *
 * Input Parameters:
 *   irq - The IRQ number that generated the interrupt
 *   context - Architecture specific register save information.
 *
 * Returned Value:
 *   Zero (OK) on success; A negated errno value on failure.
 *
 ****************************************************************************/

#ifdef CONFIG_RTC_ALARM
static int rtc_alm_interrupt(int irq, void *context, void *arg)
{
  struct alm_cbinfo_s *cbinfo;
  alm_callback_t cb;
  uint8_t source = ra6m5_rtc_getreg(RA6M5_RTC_RCR1_OFFSET);
  if ((source & RTC_RCR1_AIE) != 0)
    {
      /* Alarm callback */

      cbinfo = &g_alarmcb;
      cb = cbinfo->ac_cb;
      arg = (void *)cbinfo->ac_arg;
      cbinfo->ac_cb  = NULL;
      cbinfo->ac_arg = NULL;
      cb(arg, 0);
    }

  up_disable_irq(RA6M5_IRQ_RTC_ALARM);
  return 0;
}
#endif

#ifdef CONFIG_RTC_PERIODIC
static int rtc_periodic_interrupt(int irq, void *context, void *arg)
{
  struct prd_cbinfo_s *cbinfo;
  periodiccb_t cb;
  uint8_t source = ra6m5_rtc_getreg(RA6M5_RTC_RCR1_OFFSET);
  if ((source & RTC_RCR1_PIE) != 0)
    {
      /* Periodic callback */

      cbinfo = &g_periodiccb;
      cb = cbinfo->prd_cb;
      arg = (void *)cbinfo->prd_arg;
      cb(arg, 0);
    }

  return 0;
}
#endif

#ifdef CONFIG_RA6M5_RTC_CARRY
static int rtc_carry_interrupt(int irq, void *context, void *arg)
{
  uint8_t source = ra6m5_rtc_getreg(RA6M5_RTC_RCR1_OFFSET);
  if ((source & RTC_RCR1_CIE) != 0)
    {
      /* Carry callback */

      g_carrycb();
    }

  return 0;
}

#endif

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: up_rtc_initialize
 *
 * Description:
 *   Initialize the hardware RTC per the selected configuration.
 *   This function is
 *   called once during the OS initialization sequence
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   Zero (OK) on success; a negated errno on failure
 *
 ****************************************************************************/

int up_rtc_initialize(void)
{
  uint8_t regval;
  uint32_t temp_byte;
  rtc_dumpregs("On reset");

