gmtcontrol/nuttx/arch/arm/src/ra6m5/ra6m5_rtc.c
  /* Disable alarm, periodic and carry interrupts */

  up_disable_irq(RA6M5_IRQ_RTC_ALARM);
  up_disable_irq(RA6M5_IRQ_RTC_PERIOD);
  up_disable_irq(RA6M5_IRQ_RTC_CARRY);

  /* Set RTC clock source as sub clock */

  regval = ra6m5_rtc_getreg(RA6M5_RTC_RCR4_OFFSET);
  regval &= ~RTC_RCR4_RCKSEL;
  ra6m5_rtc_putreg(RA6M5_RTC_RCR4_OFFSET, regval);

  /* Stop all counters */

  ra6m5_rtc_putreg(RA6M5_RTC_RCR2_OFFSET, 0);
  while ((regval = ra6m5_rtc_getreg(RA6M5_RTC_RCR2_OFFSET)) & RTC_RCR2_START)
    {
      /* Ensure the clock is stopped while configuring it. */
    }

  /* Select count mode */

  regval &= ~RTC_RCR2_CNTMD;
  ra6m5_rtc_putreg(RA6M5_RTC_RCR2_OFFSET, regval);

  while ((regval = ra6m5_rtc_getreg(RA6M5_RTC_RCR2_OFFSET)) & RTC_RCR2_CNTMD)
    {
      /* Wait for the calendar count mode complete setting */
    }

  /* Execute RTC software reset */

  regval |= RTC_RCR2_RESET;
  ra6m5_rtc_putreg(RA6M5_RTC_RCR2_OFFSET, regval);

  while ((regval = ra6m5_rtc_getreg(RA6M5_RTC_RCR2_OFFSET)) & RTC_RCR2_RESET)
    {
      /* Wait for the reset to complete */
    }

  /* Stop RTC counter */

  regval &= ~(RTC_RCR2_START);
  ra6m5_rtc_putreg(RA6M5_RTC_RCR2_OFFSET, regval);

  while (ra6m5_rtc_getreg(RA6M5_RTC_RCR2_OFFSET) & RTC_RCR2_START)
    {
      /* Ensure the clock is stopped while configuring it. */
    }

  /* Clear ALM, PRD, CUP IRQ */

  up_clear_irq(RA6M5_IRQ_RTC_ALARM);
  up_clear_irq(RA6M5_IRQ_RTC_PERIOD);
  up_clear_irq(RA6M5_IRQ_RTC_CARRY);

  /* After a reset is generated, write to the RTC register
   * when six cycles of the count source have elapsed
   */

  up_udelay(RTC_WAIT_PERIOD);

  /* Start the counter and set 24hr mode */

  regval = ra6m5_rtc_getreg(RA6M5_RTC_RCR2_OFFSET);
  regval |= (RTC_RCR2_HR24);
  ra6m5_rtc_putreg(RA6M5_RTC_RCR2_OFFSET, regval);

  /* Setting RADJ register */

  regval = ra6m5_rtc_getreg(RA6M5_RTC_RADJ_OFFSET);
  regval |= (RTC_RADJ_INITVALUE);
  ra6m5_rtc_putreg(RA6M5_RTC_RADJ_OFFSET, regval);

  /* Setting AADJE and AADJP register */

  regval = ra6m5_rtc_getreg(RA6M5_RTC_RCR2_OFFSET);
  regval |= (RTC_RCR2_AADJE | RTC_RCR2_AADJP);
  ra6m5_rtc_putreg(RA6M5_RTC_RCR2_OFFSET, regval);
  g_rtc_enabled = true;
  UNUSED(temp_byte);
  return OK;
}

/****************************************************************************
 * Name: up_rtc_gettime
 *
 * Description:
 *   Get the current date and time from the date/time RTC.
 * Input Parameters:
 *   tp - The location to return the high resolution time value.
 *
 * Returned Value:
 *   Zero (OK) on success; a negated errno on failure
 *
 ****************************************************************************/

#if defined(CONFIG_RTC_HIRES)
int up_rtc_gettime(struct timespec *tp)
{
  uint8_t weekcnt;
  uint8_t daycnt;
  uint8_t monthcnt;
  uint8_t yearcnt;
  uint8_t seccnt;
  uint8_t mincnt;
  uint8_t hrcnt;
  uint8_t tmp_week;
  uint8_t tmp_day;
  uint8_t tmp_month;
  uint8_t tmp_year;
  uint16_t bcd_years;
  uint8_t regval;
  struct tm t;

  regval = ra6m5_rtc_getreg(RA6M5_RTC_RCR2_OFFSET);
  if (!(regval & RTC_RCR2_START))
    {
      regval |= RTC_RCR2_START;
      ra6m5_rtc_putreg(RA6M5_RTC_RCR2_OFFSET, regval);
    }

  do
    {
      weekcnt  = ra6m5_rtc_getreg(RA6M5_RTC_RWKCNT_OFFSET);
      daycnt   = ra6m5_rtc_getreg(RA6M5_RTC_RDAYCNT_OFFSET);
      monthcnt = ra6m5_rtc_getreg(RA6M5_RTC_RMONCNT_OFFSET);
      yearcnt  = ra6m5_rtc_getreg(RA6M5_RTC_RYRCNT_OFFSET);
      seccnt   = ra6m5_rtc_getreg(RA6M5_RTC_RSECCNT_OFFSET);
      mincnt   = ra6m5_rtc_getreg(RA6M5_RTC_RMINCNT_OFFSET);
      hrcnt    = ra6m5_rtc_getreg(RA6M5_RTC_RHRCNT_OFFSET);
      tmp_week = ra6m5_rtc_getreg(RA6M5_RTC_RWKCNT_OFFSET);
      tmp_day  = ra6m5_rtc_getreg(RA6M5_RTC_RDAYCNT_OFFSET);
      tmp_month = ra6m5_rtc_getreg(RA6M5_RTC_RMONCNT_OFFSET);
      tmp_year  = ra6m5_rtc_getreg(RA6M5_RTC_RYRCNT_OFFSET);
    }

  while (tmp_week != weekcnt && tmp_day != daycnt &&
         tmp_month != monthcnt && tmp_year != yearcnt);

  /* Disable Carry interrupt */

  up_disable_irq(RA6M5_IRQ_RTC_CARRY);

  /* Enable RTC carry interrupt */

  regval = ra6m5_rtc_getreg(RA6M5_RTC_RCR1_OFFSET);
  regval |= (RTC_RCR1_CIE);
  ra6m5_rtc_putreg(RA6M5_RTC_RCR1_OFFSET, regval);

  do
    {
      /* Clear carry flag in ICU */

      up_clear_irq(RA6M5_IRQ_RTC_CARRY);

      /* Read and convert RTC registers;
       * mask off unknown bits and hour am/pm.
       */

      /* Seconds. (0-59) */

      t.tm_sec  = rtc_bcd2dec((uint8_t) (ra6m5_rtc_getreg(RA6M5_RTC_RSECCNT_OFFSET) & 0x7fu));
      t.tm_min  = rtc_bcd2dec((uint8_t) (ra6m5_rtc_getreg(RA6M5_RTC_RMINCNT_OFFSET) & 0x7fu));
      t.tm_hour = rtc_bcd2dec((uint8_t) (ra6m5_rtc_getreg(RA6M5_RTC_RHRCNT_OFFSET) & 0x3fu));
      t.tm_mday = rtc_bcd2dec(ra6m5_rtc_getreg(RA6M5_RTC_RDAYCNT_OFFSET));
      t.tm_mon  = rtc_bcd2dec(ra6m5_rtc_getreg(RA6M5_RTC_RMONCNT_OFFSET)) - 1;

      /* Years since 2000 */

      bcd_years = (uint16_t) ra6m5_rtc_getreg16(RA6M5_RTC_RYRCNT_OFFSET);

      t.tm_year = rtc_bcd2dec((uint8_t) (bcd_years & 0xff)) + 100;

      tp->tv_sec = timegm(&t);
      tp->tv_nsec = 0;
    }

  while (up_status_irq(RA6M5_IRQ_RTC_CARRY));

  UNUSED(hrcnt);
  UNUSED(mincnt);
  UNUSED(seccnt);
  return OK;
}
#endif

int ra6m5_rtc_setdatetime(const struct tm *tp)
{
  volatile uint8_t dummy_byte;
  volatile uint16_t dummy_word;
  uint8_t regval;
  int i;

  /* Break out the time values (note that the time is set only to units of
   * seconds)
   */

  /* gmtime_r(&tp->tv_sec, &tp); */

  rtc_dumptime(&tp, "Setting time");

  /* Then write the broken out values to the RTC */

  /* Convert the struct tm format to RTC time register fields.
   *
   *   struct tm       TIMR register
   *   tm_sec    0-61* SEC    (0-59)
   *   tm_min    0-59  MIN    (0-59)
   *   tm_hour   0-23  HOUR   (0-23)
   *
   *  *To allow for leap seconds.  But these never actuall happen.
   */

  /* Stop all counters */

  regval = ra6m5_rtc_getreg(RA6M5_RTC_RCR2_OFFSET);
  regval &= ~(RTC_RCR2_START);
  ra6m5_rtc_putreg(RA6M5_RTC_RCR2_OFFSET, regval);

  while ((regval = ra6m5_rtc_getreg(RA6M5_RTC_RCR2_OFFSET)) & RTC_RCR2_START)
    {
      /* Ensure the clock is stopped while configuring it. */
    }

  /* Execute RTC software reset */

  regval |= RTC_RCR2_RESET;
  ra6m5_rtc_putreg(RA6M5_RTC_RCR2_OFFSET, regval);

