gmtcontrol/nuttx/arch/arm/src/ra6m5/ra6m5_rtc.c
  while ((regval = ra6m5_rtc_getreg(RA6M5_RTC_RCR2_OFFSET)) & RTC_RCR2_RESET)
    {
      /* Wait for the reset to complete */
    }

  regval |= RTC_RCR2_HR24;
  ra6m5_rtc_putreg(RA6M5_RTC_RCR2_OFFSET, regval);

  /* Set time */

  /* Set seconds. (0-59) */

  ra6m5_rtc_putreg(RA6M5_RTC_RSECCNT_OFFSET, rtc_dec2bcd((uint8_t)tp->tm_sec));

  /* WAIT_LOOP */

  for (i = 0; i < RTC_DUMMY_READ; i++)
    {
      dummy_byte = ra6m5_rtc_getreg(RA6M5_RTC_RSECCNT_OFFSET);
    }

  /* Set minutes (0-59) */

  ra6m5_rtc_putreg(RA6M5_RTC_RMINCNT_OFFSET, rtc_dec2bcd((uint8_t) tp->tm_min));

  /* WAIT_LOOP */

  for (i = 0; i < RTC_DUMMY_READ; i++)
    {
      dummy_byte = ra6m5_rtc_getreg(RA6M5_RTC_RMINCNT_OFFSET);
    }

  /* Set hours. (0-23) */

  ra6m5_rtc_putreg(RA6M5_RTC_RHRCNT_OFFSET, rtc_dec2bcd((uint8_t) tp->tm_hour));

  /* WAIT_LOOP */

  for (i = 0; i < RTC_DUMMY_READ; i++)
    {
      dummy_byte = ra6m5_rtc_getreg(RA6M5_RTC_RHRCNT_OFFSET);
    }

  /* Set the date */

  /* Day of the week (0-6, 0=Sunday) */

#if defined(CONFIG_LIBC_LOCALTIME) || defined(CONFIG_TIME_EXTENDED)
  ra6m5_rtc_putreg(RA6M5_RTC_RWKCNT_OFFSET, rtc_dec2bcd((uint8_t) tp->tm_wday));

  /* WAIT_LOOP */

  for (i = 0; i < RTC_DUMMY_READ; i++)
    {
      dummy_byte = ra6m5_rtc_getreg(RA6M5_RTC_RWKCNT_OFFSET);
    }
#endif

  /* Day of the month (1-31) */

  ra6m5_rtc_putreg(RA6M5_RTC_RDAYCNT_OFFSET, rtc_dec2bcd((uint8_t) tp->tm_mday));

  /* WAIT_LOOP */

  for (i = 0; i < RTC_DUMMY_READ; i++)
    {
      dummy_byte = ra6m5_rtc_getreg(RA6M5_RTC_RDAYCNT_OFFSET);
    }

  /* Month. (1-12, 1=January) */

  ra6m5_rtc_putreg(RA6M5_RTC_RMONCNT_OFFSET, rtc_dec2bcd((uint8_t) (tp->tm_mon + 1)));

  /* WAIT_LOOP */

  for (i = 0; i < RTC_DUMMY_READ; i++)
    {
      dummy_byte = ra6m5_rtc_getreg(RA6M5_RTC_RMONCNT_OFFSET);
    }

  /* Year. (00-99) */

  ra6m5_rtc_putreg16(RA6M5_RTC_RYRCNT_OFFSET, (uint16_t) (rtc_dec2bcd((uint8_t)((tp->tm_year + 1900) % 100))));

  /* WAIT_LOOP */

  for (i = 0; i < RTC_DUMMY_READ; i++)
    {
      dummy_word = ra6m5_rtc_getreg16(RA6M5_RTC_RYRCNT_OFFSET);
    }

  regval = ra6m5_rtc_getreg(RA6M5_RTC_RCR2_OFFSET);
  regval |= RTC_RCR2_START;
  ra6m5_rtc_putreg(RA6M5_RTC_RCR2_OFFSET, regval);

  rtc_dumpregs("New time setting");
  UNUSED(dummy_word);
  UNUSED(dummy_byte);
  return OK;
}

/****************************************************************************
 * Name: up_rtc_settime
 *
 * Description:
 *   Set the RTC to the provided time.  All RTC implementations
 *   must be able to
 *   set their time based on a standard timespec.
 *
 * Input Parameters:
 *   tp - the time to use
 *
 * Returned Value:
 *   Zero (OK) on success; a negated errno on failure
 *
 ****************************************************************************/

int up_rtc_settime(const struct timespec *tp)
{
  struct tm newtime;
  int i;
  volatile uint8_t dummy_byte;
  volatile uint16_t dummy_word;
  uint8_t regval;

  /* Break out the time values (note that the time is set only to units of
   * seconds)
   */

  gmtime_r(&tp->tv_sec, &newtime);
  rtc_dumptime(&newtime, "Setting time");

  /* Then write the broken out values to the RTC */

  /* Convert the struct tm format to RTC time register fields.
   *
   *   struct tm       TIMR register
   *   tm_sec    0-61* SEC    (0-59)
   *   tm_min    0-59  MIN    (0-59)
   *   tm_hour   0-23  HOUR   (0-23)
   *
   *  *To allow for leap seconds.  But these never actuall happen.
   */

  /* Stop all counters */

  regval = ra6m5_rtc_getreg(RA6M5_RTC_RCR2_OFFSET);
  regval &= ~RTC_RCR2_START;
  ra6m5_rtc_putreg(RA6M5_RTC_RCR2_OFFSET, regval);

  while ((regval = ra6m5_rtc_getreg(RA6M5_RTC_RCR2_OFFSET)) & RTC_RCR2_START)
    {
      /* Ensure the clock is stopped while configuring it. */
    }

  /* Execute RTC software reset */

  regval |= RTC_RCR2_RESET;
  ra6m5_rtc_putreg(RA6M5_RTC_RCR2_OFFSET, regval);

  while ((regval = ra6m5_rtc_getreg(RA6M5_RTC_RCR2_OFFSET)) & RTC_RCR2_RESET)
    {
      /* Wait for the reset to complete */
    }

  regval |= RTC_RCR2_HR24;
  ra6m5_rtc_putreg(RA6M5_RTC_RCR2_OFFSET, regval);

  /* Set time */

  /* Set seconds. (0-59) */

  ra6m5_rtc_putreg(RA6M5_RTC_RSECCNT_OFFSET, rtc_dec2bcd((uint8_t)newtime.tm_sec));

  /* WAIT_LOOP */

  for (i = 0; i < RTC_DUMMY_READ; i++)
    {
      dummy_byte = ra6m5_rtc_getreg(RA6M5_RTC_RSECCNT_OFFSET);
    }

  /* Set minutes (0-59) */

  ra6m5_rtc_putreg(RA6M5_RTC_RMINCNT_OFFSET, rtc_dec2bcd((uint8_t) newtime.tm_min));

  /* WAIT_LOOP */

  for (i = 0; i < RTC_DUMMY_READ; i++)
    {
      dummy_byte = ra6m5_rtc_getreg(RA6M5_RTC_RMINCNT_OFFSET);
    }

  /* Set hours. (0-23) */

  ra6m5_rtc_putreg(RA6M5_RTC_RHRCNT_OFFSET, rtc_dec2bcd((uint8_t) newtime.tm_hour));

  /* WAIT_LOOP */

  for (i = 0; i < RTC_DUMMY_READ; i++)
    {
      dummy_byte = ra6m5_rtc_getreg(RA6M5_RTC_RHRCNT_OFFSET);
    }

  /* Set the date */

  /* Day of the week (0-6, 0=Sunday) */

  ra6m5_rtc_putreg(RA6M5_RTC_RWKCNT_OFFSET, rtc_dec2bcd((uint8_t) newtime.tm_wday));

  /* WAIT_LOOP */

  for (i = 0; i < RTC_DUMMY_READ; i++)
    {
      dummy_byte = ra6m5_rtc_getreg(RA6M5_RTC_RWKCNT_OFFSET);
    }

  /* Day of the month (1-31) */

  ra6m5_rtc_putreg(RA6M5_RTC_RDAYCNT_OFFSET, rtc_dec2bcd((uint8_t) newtime.tm_mday));

  /* WAIT_LOOP */

  for (i = 0; i < RTC_DUMMY_READ; i++)
    {
      dummy_byte = ra6m5_rtc_getreg(RA6M5_RTC_RDAYCNT_OFFSET);
    }

  /* Month. (1-12, 1=January) */

  ra6m5_rtc_putreg(RA6M5_RTC_RMONCNT_OFFSET, rtc_dec2bcd((uint8_t) (newtime.tm_mon + 1)));

  /* WAIT_LOOP */

  for (i = 0; i < RTC_DUMMY_READ; i++)
    {
      dummy_byte = ra6m5_rtc_getreg(RA6M5_RTC_RMONCNT_OFFSET);
    }

  /* Year. (00-99) */

  ra6m5_rtc_putreg16(RA6M5_RTC_RYRCNT_OFFSET, (uint16_t) (rtc_dec2bcd((uint8_t)((newtime.tm_year + 1900) % 100))));

  /* WAIT_LOOP */

  for (i = 0; i < RTC_DUMMY_READ; i++)
    {
      dummy_word = ra6m5_rtc_getreg16(RA6M5_RTC_RYRCNT_OFFSET);
    }

  regval = ra6m5_rtc_getreg(RA6M5_RTC_RCR2_OFFSET);
  regval |= RTC_RCR2_START;
  ra6m5_rtc_putreg(RA6M5_RTC_RCR2_OFFSET, regval);

  rtc_dumpregs("New time setting");
  UNUSED(dummy_word);
  UNUSED(dummy_byte);
  return OK;
}

/****************************************************************************
 * Name: ra6m5_rtc_getalarmdatetime
 *
 * Description:
 *   Get the current date and time for a RTC alarm.
 *
 * Input Parameters:
 *   reg - RTC alarm register
 *   tp - The location to return the high resolution time value.
 *
 * Returned Value:
 *   Zero (OK) on success; a negated errno on failure
 *
 ****************************************************************************/

#ifdef CONFIG_RTC_ALARM
static int ra6m5_rtc_getalarmdatetime(struct tm *tp)
{
  uint8_t bcd_years;
  DEBUGASSERT(tp != NULL);

