gmtcontrol/nuttx/arch/arm/src/ra6m5/ra6m5_rtc.c
  tp->tm_sec  = rtc_bcd2dec((uint8_t) (ra6m5_rtc_getreg(RA6M5_RTC_RSECAR_OFFSET) & 0x7fu));
  tp->tm_min  = rtc_bcd2dec((uint8_t) (ra6m5_rtc_getreg(RA6M5_RTC_RMINAR_OFFSET) & 0x7fu));
  tp->tm_hour = rtc_bcd2dec((uint8_t) (ra6m5_rtc_getreg(RA6M5_RTC_RHRAR_OFFSET) & 0x3fu));
  tp->tm_mday = rtc_bcd2dec(ra6m5_rtc_getreg(RA6M5_RTC_RDAYAR_OFFSET) & 0x3fu);
  tp->tm_mon  = rtc_bcd2dec(ra6m5_rtc_getreg(RA6M5_RTC_RMONAR_OFFSET) & 0x1fu) - 1;

  /* Years since 2000 */

  bcd_years = (uint8_t) ra6m5_rtc_getreg16(RA6M5_RTC_RYRAR_OFFSET);

  tp->tm_year = rtc_bcd2dec((uint8_t) (bcd_years & 0xff)) + 100;
  return 0;
}

#endif
/****************************************************************************
 * Name: ra6m5_rtc_rdalarm
 *
 * Description:
 *   Query an alarm configured in hardware.
 *
 * Input Parameters:
 *  alminfo - Information about the alarm configuration.
 *
 * Returned Value:
 *   Zero (OK) on success; a negated errno on failure
 *
 ****************************************************************************/

#ifdef CONFIG_RTC_ALARM
int ra6m5_rtc_rdalarm(struct alm_rdalarm_s *alminfo)
{
  int ret = -EINVAL;
  DEBUGASSERT(alminfo != NULL);
  ret = ra6m5_rtc_getalarmdatetime((struct tm *)alminfo->ar_time);
  return ret;
}
#endif

/****************************************************************************
 * Name: ra6m5_rtc_setalarm
 *
 * Description:
 *   Set up an alarm.
 *
 * Input Parameters:
 *   tp - the time to set the alarm
 *   callback - the function to call when the alarm expires.
 *
 * Returned Value:
 *   Zero (OK) on success; a negated errno on failure
 *
 ****************************************************************************/

#ifdef CONFIG_RTC_ALARM
int ra6m5_rtc_setalarm(struct alm_setalarm_s *alminfo)
{
  irqstate_t flags;
  uint8_t dummy_byte;
  uint8_t dummy_word;
  uint8_t i, regval;

  /* Is there already something waiting on the ALARM? */

  flags = enter_critical_section();

  /* Save the callback info */

  g_alarmcb.ac_cb  = alminfo->as_cb;
  g_alarmcb.ac_arg = alminfo->as_arg;

  /* Disable ICU alarm interrupt */

  up_disable_irq(RA6M5_IRQ_RTC_ALARM);

  /* Attach the Alarm Interrupt */

  irq_attach(RA6M5_IRQ_RTC_ALARM, rtc_alm_interrupt, NULL);

  /* Start RTC counter */

  regval = ra6m5_rtc_getreg(RA6M5_RTC_RCR2_OFFSET);
  regval |= RTC_RCR2_START;
  ra6m5_rtc_putreg(RA6M5_RTC_RCR2_OFFSET, regval);

  while (!(ra6m5_rtc_getreg(RA6M5_RTC_RCR2_OFFSET) & RTC_RCR2_START))
    {
      /* Wait for the register modification to complete */
    }

  /* Set time */

  /* Set seconds. (0-59) */

  ra6m5_rtc_putreg(RA6M5_RTC_RSECAR_OFFSET, 0x80u);

  /* WAIT_LOOP */

  for (i = 0; i < RTC_DUMMY_READ; i++)
    {
       dummy_byte = ra6m5_rtc_getreg(RA6M5_RTC_RSECAR_OFFSET);
    }

  regval = ra6m5_rtc_getreg(RA6M5_RTC_RSECAR_OFFSET);
  regval |= rtc_dec2bcd((uint8_t)alminfo->as_time.tm_sec);
  ra6m5_rtc_putreg(RA6M5_RTC_RSECAR_OFFSET, regval);

  /* WAIT_LOOP */

  for (i = 0; i < RTC_DUMMY_READ; i++)
    {
      dummy_byte = ra6m5_rtc_getreg(RA6M5_RTC_RSECAR_OFFSET);
    }

  /* Set minutes (0-59) */

  ra6m5_rtc_putreg(RA6M5_RTC_RMINAR_OFFSET, 0x80u);

  /* WAIT_LOOP */

  for (i = 0; i < RTC_DUMMY_READ; i++)
    {
       dummy_byte = ra6m5_rtc_getreg(RA6M5_RTC_RMINAR_OFFSET);
    }

  regval = ra6m5_rtc_getreg(RA6M5_RTC_RMINAR_OFFSET);
  regval |= rtc_dec2bcd((uint8_t) alminfo->as_time.tm_min);
  ra6m5_rtc_putreg(RA6M5_RTC_RMINAR_OFFSET, regval);

  /* WAIT_LOOP */

  for (i = 0; i < RTC_DUMMY_READ; i++)
    {
       dummy_byte = ra6m5_rtc_getreg(RA6M5_RTC_RMINAR_OFFSET);
    }

  /* Set hours. (0-23) */

  ra6m5_rtc_putreg(RA6M5_RTC_RHRAR_OFFSET, 0x80u);

  /* WAIT_LOOP */

  for (i = 0; i < RTC_DUMMY_READ; i++)
    {
      dummy_byte = ra6m5_rtc_getreg(RA6M5_RTC_RHRAR_OFFSET);
    }

  regval = ra6m5_rtc_getreg(RA6M5_RTC_RHRAR_OFFSET);
  regval |= rtc_dec2bcd((uint8_t) alminfo->as_time.tm_hour);
  ra6m5_rtc_putreg(RA6M5_RTC_RHRAR_OFFSET, regval);

  /* WAIT_LOOP */

  for (i = 0; i < RTC_DUMMY_READ; i++)
    {
      dummy_byte = ra6m5_rtc_getreg(RA6M5_RTC_RHRAR_OFFSET);
    }

  /* Day of the month (1-31) */

  ra6m5_rtc_putreg(RA6M5_RTC_RDAYAR_OFFSET, 0x80u);

  /* WAIT_LOOP */

  for (i = 0; i < RTC_DUMMY_READ; i++)
    {
       dummy_byte = ra6m5_rtc_getreg(RA6M5_RTC_RDAYAR_OFFSET);
    }

  regval = ra6m5_rtc_getreg(RA6M5_RTC_RDAYAR_OFFSET);
  regval |= rtc_dec2bcd((uint8_t) alminfo->as_time.tm_mday);
  ra6m5_rtc_putreg(RA6M5_RTC_RDAYAR_OFFSET, regval);

  /* WAIT_LOOP */

  for (i = 0; i < RTC_DUMMY_READ; i++)
    {
       dummy_byte = ra6m5_rtc_getreg(RA6M5_RTC_RDAYAR_OFFSET);
    }

  /* Month. (1-12, 1=January) */

  ra6m5_rtc_putreg(RA6M5_RTC_RMONAR_OFFSET, 0x80u);

  /* WAIT_LOOP */

  for (i = 0; i < RTC_DUMMY_READ; i++)
    {
      dummy_byte = ra6m5_rtc_getreg(RA6M5_RTC_RMONAR_OFFSET);
    }

  regval = ra6m5_rtc_getreg(RA6M5_RTC_RMONAR_OFFSET);
  regval |= rtc_dec2bcd((uint8_t) ((alminfo->as_time.tm_mon) + 1));
  ra6m5_rtc_putreg(RA6M5_RTC_RMONAR_OFFSET, regval);

  /* WAIT_LOOP */

  for (i = 0; i < RTC_DUMMY_READ; i++)
    {
      dummy_byte = ra6m5_rtc_getreg(RA6M5_RTC_RMONAR_OFFSET);
    }

  /* Year. (00-99) */

  //ra6m5_rtc_putreg(RA6M5_RTC_RYRAREN_OFFSET, 0x80u);

  /* WAIT_LOOP */

  for (i = 0; i < RTC_DUMMY_READ; i++)
    {
      dummy_byte = ra6m5_rtc_getreg(RA6M5_RTC_RYRAREN_OFFSET);
    }

  ra6m5_rtc_putreg16(RA6M5_RTC_RYRAR_OFFSET, 
                      (uint16_t) (rtc_dec2bcd((uint8_t)((alminfo->as_time.tm_year) + 1900))));

  /* WAIT_LOOP */

  for (i = 0; i < RTC_DUMMY_READ; i++)
    {
      dummy_word = ra6m5_rtc_getreg16(RA6M5_RTC_RYRAR_OFFSET);
    }

  rtc_dumpregs("New alarm setting");

  /* Enable RTC ALARM interrupt */

  regval = ra6m5_rtc_getreg(RA6M5_RTC_RCR1_OFFSET);
  regval |= RTC_RCR1_AIE;
  ra6m5_rtc_putreg(RA6M5_RTC_RCR1_OFFSET, regval);

  /* Clear IR flag of ICU ALARM interrupt */

  up_clear_irq(RA6M5_IRQ_RTC_ALARM);

  /* Enable ICU alarm interrupts */

  up_enable_irq(RA6M5_IRQ_RTC_ALARM);

  /* Set Priority of alarm interrupt */

  leave_critical_section(flags);
  UNUSED(dummy_byte);
  UNUSED(dummy_word);
  return OK;
}
#endif

#ifdef CONFIG_RTC_PERIODIC
int ra6m5_rtc_setperiodic(const struct timespec *period,
                          periodiccb_t callback)
{
  irqstate_t flags;
  volatile uint8_t regval;
  uint8_t prd;
  flags = enter_critical_section();

