gmtcontrol/nuttx/arch/arm/src/ra6m5/ra6m5_rtc.c
  /* No.. Save the callback function pointer */

  g_periodiccb.prd_cb = callback;
  prd = period->tv_sec;

  /* Disable ICU periodic interrupt */

  up_disable_irq(RA6M5_IRQ_RTC_PERIOD);

  /* Clear IRQ flag of periodic interrupt */

  up_clear_irq(RA6M5_IRQ_RTC_PERIOD);

  /* Set RTC control register 1 */

  regval = ra6m5_rtc_getreg(RA6M5_RTC_RCR1_OFFSET);
  regval &= ~RTC_RCR1_PES_MASK;
  regval |= (RTC_RCR1_PIE | RTC_RCR1_PES(prd));
  ra6m5_rtc_putreg(RA6M5_RTC_RCR1_OFFSET, regval);

  /* Attach the isr */

  irq_attach(RA6M5_IRQ_RTC_PERIOD, rtc_periodic_interrupt, NULL);

  /* Start RTC counter */

  regval = ra6m5_rtc_getreg(RA6M5_RTC_RCR2_OFFSET);
  regval |= RTC_RCR2_START;
  ra6m5_rtc_putreg(RA6M5_RTC_RCR2_OFFSET, regval);

  /* Enable ICU periodic interrupt */

  up_enable_irq(RA6M5_IRQ_RTC_PERIOD);

  /* Set periodic interrupt priority level */

  leave_critical_section(flags);
  return OK;
}
#endif

#ifdef CONFIG_RA6M5_RTC_CARRY
void ra6m5_rtc_set_carry(carrycb_t callback)
{
  uint8_t regval;
  irqstate_t flags;
  flags = enter_critical_section();

  /* No.. Save the callback function pointer */

  g_carrycb = callback;

  /* Clear IRQ flag of carry interrupt */

  up_clear_irq(RA6M5_IRQ_RTC_CARRY);

  /* Attach the isr */

  irq_attach(RA6M5_IRQ_RTC_CARRY, rtc_carry_interrupt, NULL);

  /* Start the timer */

  regval = ra6m5_rtc_getreg(RA6M5_RTC_RCR2_OFFSET);
  regval |= RTC_RCR2_START;
  ra6m5_rtc_putreg(RA6M5_RTC_RCR2_OFFSET, regval);

  /* Enable ICU carry interrupt */

  up_enable_irq(RA6M5_IRQ_RTC_CARRY);

  /* Set carry interrupt priority level */

  leave_critical_section(flags);
}

#endif
#ifdef CONFIG_RTC_ALARM
int ra6m5_rtc_cancelalarm(void)
{
  irqstate_t flags;
  int ret = -ENODATA;
  uint8_t regval;

  flags = enter_critical_section();

  /* Disable ICU alarm interrupt */

  up_disable_irq(RA6M5_IRQ_RTC_ALARM);

  /* Disable RTC periodic interrupt */

  regval = ra6m5_rtc_getreg(RA6M5_RTC_RCR1_OFFSET);
  regval &= ~RTC_RCR1_AIE;
  ra6m5_rtc_putreg(RA6M5_RTC_RCR1_OFFSET, regval);

  while (ra6m5_rtc_getreg(RA6M5_RTC_RCR1_OFFSET) & RTC_RCR1_AIE)
    {
      /* Wait for this write to complete. */
    }

  /* Clear IRQ flag of ALARM interrupt */

  up_clear_irq(RA6M5_IRQ_RTC_ALARM);

  /* Cancel the global callback function */

  g_alarmcb.ac_cb = NULL;
  g_alarmcb.ac_arg = NULL;

  /* Unset the alarm */

  ra6m5_rtc_putreg(RA6M5_RTC_RSECAR_OFFSET, 0x0);
  ra6m5_rtc_putreg(RA6M5_RTC_RMINAR_OFFSET, 0x0);
  ra6m5_rtc_putreg(RA6M5_RTC_RHRAR_OFFSET, 0x0);
  ra6m5_rtc_putreg(RA6M5_RTC_RWKAR_OFFSET, 0x0);
  ra6m5_rtc_putreg(RA6M5_RTC_RDAYAR_OFFSET, 0x0);
  ra6m5_rtc_putreg(RA6M5_RTC_RMONAR_OFFSET, 0x0);
  ra6m5_rtc_putreg16(RA6M5_RTC_RYRAR_OFFSET, 0x0);
  ret = OK;

  leave_critical_section(flags);

  return ret;
}

#endif

#ifdef CONFIG_RTC_PERIODIC
int ra6m5_rtc_cancelperiodic(void)
{
  uint8_t regval;

  /* Disable ICU periodic interrupt */

  up_disable_irq(RA6M5_IRQ_RTC_PERIOD);

  /* Disable RTC periodic interrupt */

  regval = ra6m5_rtc_getreg(RA6M5_RTC_RCR1_OFFSET);
  regval &= ~RTC_RCR1_PIE;
  ra6m5_rtc_putreg(RA6M5_RTC_RCR1_OFFSET, regval);

  while (ra6m5_rtc_getreg(RA6M5_RTC_RCR1_OFFSET) & RTC_RCR1_PIE)
    {
      /* Wait for this write to complete. */
    }

  /* Clear IRQ flag of periodic interrupt */

  up_clear_irq(RA6M5_IRQ_RTC_PERIOD);

  return OK;
}

#endif

#if defined(CONFIG_RA6M5_RTC_CARRY)

int ra6m5_rtc_cancelcarry(void)
{
  uint8_t regval;

  /* Disable ICU carry interrupt */

  up_disable_irq(RA6M5_IRQ_RTC_CARRY);

  /* Disable RTC carry interrupt */

  regval = ra6m5_rtc_getreg(RA6M5_RTC_RCR1_OFFSET);
  regval &= ~RTC_RCR1_CIE;
  ra6m5_rtc_putreg(RA6M5_RTC_RCR1_OFFSET, regval);

  while (ra6m5_rtc_getreg(RA6M5_RTC_RCR1_OFFSET) & RTC_RCR1_CIE)
    {
      /* Wait for this write to complete. */
    }

  /* Clear IRQ flag of carry interrupt */

  up_clear_irq(RA6M5_IRQ_RTC_CARRY);

  return OK;
}

#endif
/****************************************************************************
 * Name: up_rtc_getdatetime
 *
 * Description:
 *   Get the current date and time from the date/time RTC.  This interface
 *   is only supported by the date/time RTC hardware implementation.
 *   It is used to replace the system timer.  It is only used
 *   by the RTOS during initialization to set up the system time
 *   when CONFIG_RTC  and CONFIG_RTC_DATETIME
 *   are selected (and CONFIG_RTC_HIRES is not).
 *
 *   NOTE: Some date/time RTC hardware is capability of sub-second accuracy.
 *   That sub-second accuracy is lost in this interface.  However,
 *   since the system time is reinitialized on each power-up/reset,
 *   there will be no timing inaccuracy in the long run.
 *
 * Input Parameters:
 *   tp - The location to return the high resolution time value.
 *
 * Returned Value:
 *   Zero (OK) on success; a negated errno on failure
 *
 ****************************************************************************/

#ifdef CONFIG_RTC_DATETIME
int up_rtc_getdatetime(struct tm *tp)
{
  uint8_t weekcnt;
  uint8_t daycnt;
  uint8_t monthcnt;
  uint8_t yearcnt;
  uint8_t seccnt;
  uint8_t mincnt;
  uint8_t hrcnt;
  uint8_t tmp_week;
  uint8_t tmp_day;
  uint8_t tmp_month;
  uint8_t tmp_year;
  uint16_t bcd_years;
  uint8_t regval;

  /* Sample the data time registers.  There is a race condition here...
   * If we sample the time just before midnight on December 31,
   * the date could be wrong because the day rolled over while were sampling.
   */

  regval = ra6m5_rtc_getreg(RA6M5_RTC_RCR2_OFFSET);
  if (!(regval & RTC_RCR2_START))
    {
      regval |= RTC_RCR2_START;
      ra6m5_rtc_putreg(RA6M5_RTC_RCR2_OFFSET, regval);
    }

  do
    {
      weekcnt  = ra6m5_rtc_getreg(RA6M5_RTC_RWKCNT_OFFSET);
      daycnt   = ra6m5_rtc_getreg(RA6M5_RTC_RDAYCNT_OFFSET);
      monthcnt = ra6m5_rtc_getreg(RA6M5_RTC_RMONCNT_OFFSET);
      yearcnt  = ra6m5_rtc_getreg(RA6M5_RTC_RYRCNT_OFFSET);
      seccnt   = ra6m5_rtc_getreg(RA6M5_RTC_RSECCNT_OFFSET);
      mincnt   = ra6m5_rtc_getreg(RA6M5_RTC_RMINCNT_OFFSET);
      hrcnt    = ra6m5_rtc_getreg(RA6M5_RTC_RHRCNT_OFFSET);
      tmp_week = ra6m5_rtc_getreg(RA6M5_RTC_RWKCNT_OFFSET);
      tmp_day  = ra6m5_rtc_getreg(RA6M5_RTC_RDAYCNT_OFFSET);
      tmp_month = ra6m5_rtc_getreg(RA6M5_RTC_RMONCNT_OFFSET);
      tmp_year  = ra6m5_rtc_getreg(RA6M5_RTC_RYRCNT_OFFSET);
    }

  while (tmp_week != weekcnt && tmp_day != daycnt &&
         tmp_month != monthcnt && tmp_year != yearcnt);

  rtc_dumpregs("Reading Time");

  /* Convert the RTC time register fields to struct tm format.
   *
   *   struct tm       TIMR register
   *   tm_sec    0-61* SEC    (0-59)
   *   tm_min    0-59  MIN    (0-59)
   *   tm_hour   0-23  HOUR   (0-23)
   *
   *  *To allow for leap seconds.  But these never actuall happen.
   */

  /* Disable carry interrupt */

  up_disable_irq(RA6M5_IRQ_RTC_CARRY);

  /* Enable RTC carry interrupt */

  regval = ra6m5_rtc_getreg(RA6M5_RTC_RCR1_OFFSET);
  regval |= (RTC_RCR1_CIE);
  ra6m5_rtc_putreg(RA6M5_RTC_RCR1_OFFSET, regval);

  do
    {
      /* Clear carry flag in ICU */

      up_clear_irq(RA6M5_IRQ_RTC_CARRY);

      /* Read and convert RTC registers;
       * mask off unknown bits and hour am/pm.
       */

      /* Seconds. (0-59) */

      tp->tm_sec = rtc_bcd2dec((uint8_t) (ra6m5_rtc_getreg(RA6M5_RTC_RSECCNT_OFFSET) & 0x7fu));

      /* Minutes. (0-59) */

      tp->tm_min = rtc_bcd2dec((uint8_t) (ra6m5_rtc_getreg(RA6M5_RTC_RMINCNT_OFFSET) & 0x7fu));

      /* Hours. (0-23) */

      tp->tm_hour = rtc_bcd2dec((uint8_t) (ra6m5_rtc_getreg(RA6M5_RTC_RHRCNT_OFFSET) & 0x3fu));

      /* Day of the month (1-31) */

      tp->tm_mday = rtc_bcd2dec(ra6m5_rtc_getreg(RA6M5_RTC_RDAYCNT_OFFSET));

      /* Months since January (0-11) */

      tp->tm_mon =  rtc_bcd2dec(ra6m5_rtc_getreg(RA6M5_RTC_RMONCNT_OFFSET)) - 1;

      /* Years since 2000 */

      bcd_years = (uint16_t) ra6m5_rtc_getreg16(RA6M5_RTC_RYRCNT_OFFSET);

      /* years years since 1900 (100-199) */

      tp->tm_year = rtc_bcd2dec((uint8_t) (bcd_years & 0xff)) + 100;

      /* Days since Sunday (0-6) */

      tp->tm_wday = (int) (ra6m5_rtc_getreg(RA6M5_RTC_RWKCNT_OFFSET) & 0x07u);
      rtc_dumptime(tp, "Returning");
    }

  while (up_status_irq(RA6M5_IRQ_RTC_CARRY));

  UNUSED(hrcnt);
  UNUSED(mincnt);
  UNUSED(seccnt);

  return OK;
}

#endif
#endif /* CONFIG_RA6M5_RTC */
